app/controllers/companies_controller.rb

INSERT INTO "companies" ("created_at", "description", "email", "location", "logo_large", "logo_small", "subdomain", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @company = Company.new(company_params)

    respond_to do |format|
      if @company.save